/*
问题描述
数学家们发现了两种用于召唤强大的数学精灵的仪式，这两种仪式分别被称为累加法仪式 A(n) 和累乘法仪式 B(n)。

累加法仪式 A(n) 是将从 1 到 n 的所有数字进行累加求和，即：A(n)=1+2+⋯+n
累乘法仪式 B(n) 则是将从 1 到 n 的所有数字进行累乘求积，即：B(n)=1×2×⋯×n
据说，当某个数字 i 满足 A(i)−B(i) 能被 100 整除时，数学精灵就会被召唤出来。

现在，请你寻找在 1 到 2024041331404202 之间有多少个数字 i，能够成功召唤出强大的数学精灵。

答案提交
这是一道结果填空题，你只需要算出结果后提交即可。本题的结果为一个整数，在提交答案时只填写这个整数，填写多余的内容将无法得分。*/
#include <iostream>
using namespace std;
int main()
{
	ios::sync_with_stdio(0), cin.tie(0), cout.tie(0);
	cout << "40480826628086" << '\n';
	return 0;
}
//1,3,24,175,199,200,224,375,399,400,424,575,599,600,624,775,799,800,824,975,999,1000