/*
问题描述
小蓝正在测试一种材料取样设备。设备可以处理长和宽均为正整数的矩形原料，每份标准样品需要消耗恰好 n 个单位的材料。

对于长为 i、宽为 j 的矩形原料，其材料总量为整数 ij，因此最多可以得到：⌊ij/n⌋ 份完整的标准样品。其中，⌊x⌋ 表示不超过 x 的最大整数。

现在，设备需要依次测试所有满足 1≤i,j<n 的正整数 i,j 所对应的矩形规格。请你计算这些测试一共可以得到多少份完整的标准样品。

由于答案可能很大，你只需要输出答案对 998244353 取模后的结果。

输入格式
输入一行，包含一个正整数 n（2≤n≤10^12），表示每份标准样品需要消耗的材料数量。

输出格式
输出一个整数，表示所有测试得到的完整标准样品总数对 998244353 取模后的结果。

样例输入
4

样例输出
5

样例说明
需要测试的矩形规格共有 9 种，对应的完整样品数量为：0,0,0,0,1,1,0,1,2

因此答案为 5。*/
/*
问题描述
小蓝正在测试一种材料取样设备。设备可以处理长和宽均为正整数的矩形原料，每份标准样品需要消耗恰好 n 个单位的材料。

对于长为 i、宽为 j 的矩形原料，其材料总量为整数 ij，因此最多可以得到：⌊ij/n⌋ 份完整的标准样品。其中，⌊x⌋ 表示不超过 x 的最大整数。

现在，设备需要依次测试所有满足 1≤i,j<n 的正整数 i,j 所对应的矩形规格。请你计算这些测试一共可以得到多少份完整的标准样品。

由于答案可能很大，你只需要输出答案对 998244353 取模后的结果。

输入格式
输入一行，包含一个正整数 n（2≤n≤10^12），表示每份标准样品需要消耗的材料数量。

输出格式
输出一个整数，表示所有测试得到的完整标准样品总数对 998244353 取模后的结果。

样例输入
4

样例输出
5

样例说明
需要测试的矩形规格共有 9 种，对应的完整样品数量为：0,0,0,0,1,1,0,1,2

因此答案为 5。*/
#include <iostream>
using namespace std;
using ll = long long;
const ll P = 998244353;

ll Pw(ll a, int b) {
    ll r = 1;
    while (b)
    {
        if (b & 1)
        {
            r = r * a % P;
        }
        a = a * a % P;
        b >>= 1;
    }
    return r;
}

int main()
{
    ios::sync_with_stdio(0), cin.tie(0), cout.tie(0);

    ll n;
    cin >> n;

    ll x = n;
    ll h = 1;
    for (ll p = 2; p * p <= x; p += p == 2 ? 1 : 2)
    {
        if (x % p == 0)
        {
            int a = 0;
            while (x % p == 0)
            {
                x /= p;
                a++;
            }
            ll t = ((a + 1LL) * (p % P) - a) % P;
            h = h * Pw(p % P, a - 1) % P * t % P;
        }
    }
    if (x > 1)
    {
        h = h * ((2 * (x % P) - 1 + P) % P) % P;
    }

    ll i2 = Pw(2, P - 2);
    ll a = (n - 1) % P;
    ll b = (n - 2) % P;
    ll s = a * a % P * b % P * i2 % P;
    s = (s + h - n % P - a + 2 * P) % P;
    ll ans = s * i2 % P;

    cout << ans << '\n';
    return 0;
}
