/*
问题描述
蓝桥学院正在筹备一场暑期程序设计竞赛集训，并计划联合其他多所学院共同参与。为此，院长提前对机房进行了座位规划：机房共设有 n 列座位，其中第 i 列提供 ai 个机位。

集训报名结束后，全部机位恰好被集训人员坐满，也就是说，机房中每一个存在的机位最终都会有人使用。

在安排座位时，为避免同校学员相互交流、影响集训效果，蓝桥学院自己的集训人员需遵守以下限制：

不能安排在同一列。
如果两人被安排在同一行，那么他们之间必须至少存在一个空位，否则不能安排在同一行。
其中，空位指的是：若某一列在这一行本身不存在机位（即该列的机位数量不足以延伸到这一行），则该位置被视为空位。

已知蓝桥学院共有 K 名集训人员参与本次集训，请你帮院长计算：仅为这 K 名蓝桥学院集训人员安排座位，共有多少种不同的合法方案？

由于答案可能很大，请将结果对 10^9+7 取模后输出。

输入格式
第一行输入两个整数 n,K(1≤K≤n≤400)，分别表示机房的列数与蓝桥学院的集训人数。

第二行输入 n 个整数 a1,a2,…,an(1≤ai≤10^6)，表示每一列的机位数量。

输出格式
输出一个整数，表示蓝桥学院集训人员合法座位安排方案的总数（对 10^9+7 取模）。

样例输入
3 2
2 1 2

样例输出
5

样例说明
对于样例而言，合法的 5 种方案如下图：*/