/*
问题描述
1024 程序员节到了，小蓝所在的公司准备举办技术分享、编程挑战等活动。各个活动的负责人陆续把海报贴到了大厅的宣传墙上，有些海报相互重叠，局部已经叠了好几层。

小蓝负责整理这些海报。

宣传墙从左到右分成 N 个位置，编号为 1,2,…,N。墙上共有 M 张海报，第 i 张海报覆盖第 Li 到第 Ri 个位置。

一个位置被几张海报覆盖，这个位置就有几层海报；没有海报覆盖的位置为 0 层。我们将所有位置中层数的最大值称为宣传墙的最大层数。

小蓝想减少海报的重叠，但又不希望一次撤下太多海报，因此决定只撤下其中一张，让宣传墙的最大层数尽可能小。小蓝可以选择任意一张海报，包括被其他海报压住的海报；他会将选中的海报完整撤下，其余海报保持原位。

现在，请你帮助小蓝计算，撤下一张海报后，宣传墙的最大层数最小可以是多少，以及有多少种选择可以达到这个最小值。选择的海报不同，即算作不同的选择。

输入格式
第一行包含两个整数 N,M（1≤N,M≤2×10^5），分别表示宣传墙的位置数量和海报数量。

接下来 M 行，每行包含两个整数 Li,Ri（1≤Li≤Ri≤N），表示第 i 张海报覆盖的位置范围。

输出格式
输出两个整数，用一个空格分隔。第一个整数表示撤下后最大层数的最小值，第二个整数表示有多少张海报在单独撤下后能达到这个最小值。

样例输入
6 4
1 3
2 5
3 4
5 6

样例输出
2 3

样例说明
原来各位置的层数依次为 1,2,3,2,2,1。分别尝试撤下四张海报：

撤下的海报	撤下后各位置的层数	最大层数
第 1 张		0,1,2,2,2,1			2
第 2 张		1,1,2,1,1,1			2
第 3 张		1,2,2,1,2,1			2
第 4 张		1,2,3,2,1,0			3
撤下第 1、2、3 张海报中的任意一张，最大层数都是 2；撤下第 4 张则是 3。因此，最大层数最小为 2，有 3 张海报在单独撤下后能达到这个值，输出 2 3。*/
#include <iostream>
#include <vector>
using namespace std;
using ll = long long;
struct Node
{
    int l, r;
};
int main()
{
    ios::sync_with_stdio(0), cin.tie(0), cout.tie(0);
    int n, m, l, r, maxn = 0, ans = 0;
    cin >> n >> m;
    vector<int> arr(n + 2, 0);
    vector<Node> hb(n);
    for (int i = 0; i < m; i++)
    {
        cin >> l >> r;
        hb[i].l = l, hb[i].r = r;
        arr[l]++, arr[r + 1]--;
    }

    int idl = 0, idr = 0;
    for (int i = 1; i <= n; i++)
    {
        arr[i] += arr[i - 1];
        if (arr[i] > maxn)
        {
            idl = idr = i;
            maxn = arr[i];
        }
        else if (arr[i] == maxn) idr = i;
    }

    for (int i = 0; i < n; i++)
    {
        if (hb[i].l <= idl && hb[i].r >= idr) ans++;
    }

    if (ans == 0)
    {
        cout << maxn << " " << m << '\n';
    }
    else
    {
        cout << maxn - 1 << " " << ans << '\n';
    }

    return 0;
}