/*
问题描述
1024 来了，小蓝报名参加了公司举办的代码阅读挑战。活动中，主办方给出了下面这段程序。

这段程序先读入一个正整数 n，执行 K 次操作后，输出 n 的值。
当 K=0 时，程序不执行操作，直接输出读入的整数。

程序的伪代码如下：

读入 n
重复 K 次：
    y = 1
    当 y × y < n 时：
        y = y + 1
    n = y
输出 n

例如，当程序读入 n=10，且 K=2 时，n 的变化过程为 10→4→2，程序最终输出 2。

作为技术大牛，小蓝需要回答 Q 个相互独立的问题，每个问题给出四个整数 L,R,K,T，要求计算出：
在 L 到 R 之间，有多少个整数可以作为程序读入的 n，使程序执行 K 次操作后输出 T？

请你帮帮小蓝。

输入格式
第一行包含一个整数 Q（1≤Q≤2×10^5），表示问题数量。

接下来 Q 行，每行包含四个整数 L,R,K,T（1≤L≤R≤10^9，0≤K≤60，1≤T≤10^18），分别表示 n 的初始值下界、初始值上界、操作次数和要求的输出结果。

输出格式
对于每个问题，输出一行一个整数，表示满足要求的 n 的初始值数量。

样例输入
3
1 20 1 3
1 100 2 3
10 30 0 20

样例输出
5
65
1

样例说明
第一个问题中，K=1，n 的初始值为 5,6,7,8,9 中的任意一个整数时，程序执行一次操作后都会输出 3，共有 5 个初始值满足要求。

第二个问题中，K=2，n 的初始值为 17 到 81 之间的任意整数时，执行一次操作后，n 都在 5 到 9 之间；
再执行一次操作，n 都变为 3。
因此共有 81−17+1=65 个初始值满足要求。

第三个问题中，K=0，程序直接输出 n 的初始值。
要让输出为 20，初始值只能是 20，因此答案为 1。
*/
#include <bits/stdc++.h>
using namespace std;
using ll=long long;
void solve()
{
  ll l,r,k,t;
  cin>>l>>r>>k>>t;
  if(k==0)
  {
    if(t>=l && t<=r) cout<<"1\n";
    else cout<<"0\n";
    return;
  }
  
  ll num1=t,num2=t,maxn=1000000001,ans;
  for(int i=1;i<=k;i++)
  {
    if(num1>31623) num1=maxn;
    else num1=(num1-1)*(num1-1)+1;
    
    if(num2>31623) num2=maxn;
    else num2=num2*num2;
  }

  ans=max(0ll,min(num2,r)-max(num1,l)+1);
  cout<<ans<<'\n';
}
int main()
{
  ios::sync_with_stdio(0),cin.tie(0),cout.tie(0);
  int q;
  cin>>q;
  while(q--)
  {
    solve();
  }
  return 0;
}
