/*
问题描述
为庆祝 1024 程序员节，蓝桥公司举办了一场主题活动，共有 2N 名员工参加。活动现场设置了一面由 2 行 N 列签到格组成的签到墙，恰好供每名员工使用一个签到格。

活动开始时，所有签到格均为空。员工依次签到，每位员工选择一个空格，贴上一张程序员节纪念贴纸。为了让签到墙在签到过程中始终保持美观，小蓝制定了以下规则：

第一名员工可以选择任意一个签到格。
此后，每名员工选择的签到格，都必须与至少一个已经贴有贴纸的签到格相邻。
如果两个签到格共用一条边或一个顶点，就认为它们相邻。也就是说，水平方向、竖直方向和对角线方向均算相邻。
所有员工完成签到后，整面签到墙恰好被填满。小蓝想知道，按照上述规则，一共有多少种不同的签到顺序。

只要两种顺序在某一步选择的签到格不同，就认为它们不同。员工身份和贴纸样式不影响方案的区分。

由于答案可能很大，请输出答案对 1000000007 取模后的结果。

输入格式
输入一行，包含一个整数 N（1≤N≤1000），表示签到墙的列数。

输出格式
输出一行，包含一个整数，表示不同签到顺序的数量对 1000000007 取模后的结果。

样例输入1
2

样例输出1
24

样例输入2
10

样例输出2
594870738

样例说明
对于 N=2 的情况，部分可能的签到顺序参考下图：*/
#include <iostream>
using namespace std;
using ll = long long;
int main()
{
    ios::sync_with_stdio(0), cin.tie(0), cout.tie(0);
    int n;
    cin >> n;
    ll a = 1, b = 2, mood = 1000000007, e = 2 * n - 1;
    while (e > 0)
    {
        if (e & 1) a = a * b % mood;
        b = b * b % mood;
        e = e / 2;
    }
    for (ll i = 1; i <= n; i++)
    {
        a = a * (2 * i - 1) % mood;
    }
    cout << a << '\n';
    return 0;
}