/*
问题描述
小蓝一觉醒来，小蓝被困在一座高耸的塔中。这座塔共有 2025 层，每一层都刻有一个数字的立方值，从底层的 1^3、2^3、3^3、⋯，一直到顶层的 2025^3 ，层层叠叠，直入云霄。
塔顶有一扇门，门旁刻着一行字：“若想离开此塔，需找出这些立方数中个位数字为 3 的数的个数。”

小蓝非常着急，因为他需要尽快离开这座塔，去参加即将到来的蓝桥杯比赛。时间紧迫，请你帮助他解答这个问题。

答案提交
这是一道结果填空题，你只需要算出结果后提交即可。本题的结果为一个整数，在提交答案时只填写这个整数，填写多余的内容将无法得分。*/
#include <iostream>
using namespace std;
using ll = long long;
int main()
{
	ios::sync_with_stdio(0), cin.tie(0), cout.tie(0);
	cout << 202 << '\n';//x7 x:0~201
	return 0;
}
/*1 1
2 8
3 7
4 4
5 5
6 6
7 3
8 2
9 9*/